eshjordan/stm32-ecu/CM4/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2021 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under Ultimate Liberty license
  * SLA0044, the "License"; You may not use this file except in compliance with
  * the License. You may obtain a copy of the License at:
  *                             www.st.com/SLA0044
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "cmsis_os.h"
#include "openamp.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "stm32mp15xx_disco.h"

#include "stm32System.h"

/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
 CRC_HandleTypeDef hcrc2;

FDCAN_HandleTypeDef hfdcan1;
FDCAN_HandleTypeDef hfdcan2;

I2C_HandleTypeDef hi2c1;

IPCC_HandleTypeDef hipcc;

RNG_HandleTypeDef hrng2;

SPI_HandleTypeDef hspi4;
SPI_HandleTypeDef hspi5;
DMA_HandleTypeDef hdma_spi5_tx;
DMA_HandleTypeDef hdma_spi5_rx;

UART_HandleTypeDef huart4;

osThreadId ledAliveHandle;
osThreadId linuxCommsHandle;
uint32_t linuxCommsBuffer[ 128 ];
osStaticThreadDef_t linuxCommsControlBlock;
osTimerId esp_in_update_tmrHandle;
osStaticTimerDef_t esp_in_update_tmrControlBlock;
osTimerId esp_out_update_tmrHandle;
osStaticTimerDef_t esp_out_update_tmrControlBlock;
osMutexId esp32DataMutexHandle;
osStaticMutexDef_t esp32DataMutexControlBlock;
/* USER CODE BEGIN PV */

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
void PeriphCommonClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_IPCC_Init(void);
static void MX_DMA_Init(void);
static void MX_SPI5_Init(void);
static void MX_RNG2_Init(void);
static void MX_I2C1_Init(void);
static void MX_UART4_Init(void);
static void MX_CRC2_Init(void);
static void MX_FDCAN1_Init(void);
static void MX_FDCAN2_Init(void);
static void MX_SPI4_Init(void);
int MX_OPENAMP_Init(int RPMsgRole, rpmsg_ns_bind_cb ns_bind_cb);
void ledAliveRunner(void const * argument);
extern void runLinuxComms(void const * argument);
extern void esp_in_update(void const * argument);
extern void esp_out_update(void const * argument);

/* USER CODE BEGIN PFP */

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{
  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  if(IS_ENGINEERING_BOOT_MODE())
  {
    /* Configure the system clock */
    SystemClock_Config();
  }

  if(IS_ENGINEERING_BOOT_MODE())
  {
    /* Configure the peripherals common clocks */
    PeriphCommonClock_Config();
  }
  else
  {
    /* IPCC initialisation */
     MX_IPCC_Init();
    /* OpenAmp initialisation ---------------------------------*/
    MX_OPENAMP_Init(RPMSG_REMOTE, NULL);
  }

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_SPI5_Init();
  MX_RNG2_Init();
  MX_I2C1_Init();
  MX_UART4_Init();
  MX_CRC2_Init();
  MX_FDCAN1_Init();
  MX_FDCAN2_Init();
  MX_SPI4_Init();
  /* USER CODE BEGIN 2 */
#if (USE_BSP_COM_FEATURE == 1U)
	COM_InitTypeDef COM_Init = { .BaudRate = 115200,
				     .WordLength = 8,
				     .StopBits = COM_STOPBITS_1,
				     .Parity = COM_PARITY_NONE,
				     .HwFlowCtl = COM_HWCONTROL_NONE };
	BSP_COM_Init(COM1, &COM_Init);
#endif
  /* USER CODE END 2 */

  /* Create the mutex(es) */
  /* definition and creation of esp32DataMutex */
  osMutexStaticDef(esp32DataMutex, &esp32DataMutexControlBlock);
  esp32DataMutexHandle = osMutexCreate(osMutex(esp32DataMutex));

  /* USER CODE BEGIN RTOS_MUTEX */
	/* add mutexes, ... */
  /* USER CODE END RTOS_MUTEX */

  /* USER CODE BEGIN RTOS_SEMAPHORES */
	/* add semaphores, ... */
  /* USER CODE END RTOS_SEMAPHORES */

  /* Create the timer(s) */
  /* definition and creation of esp_in_update_tmr */
  osTimerStaticDef(esp_in_update_tmr, esp_in_update, &esp_in_update_tmrControlBlock);
  esp_in_update_tmrHandle = osTimerCreate(osTimer(esp_in_update_tmr), osTimerPeriodic, NULL);

  /* definition and creation of esp_out_update_tmr */
  osTimerStaticDef(esp_out_update_tmr, esp_out_update, &esp_out_update_tmrControlBlock);
  esp_out_update_tmrHandle = osTimerCreate(osTimer(esp_out_update_tmr), osTimerPeriodic, NULL);

  /* USER CODE BEGIN RTOS_TIMERS */
	/* start timers, add new ones, ... */

  /* USER CODE END RTOS_TIMERS */

  /* USER CODE BEGIN RTOS_QUEUES */
	/* add queues, ... */
  /* USER CODE END RTOS_QUEUES */

  /* Create the thread(s) */
  /* definition and creation of ledAlive */
  osThreadDef(ledAlive, ledAliveRunner, osPriorityNormal, 0, 128);
  ledAliveHandle = osThreadCreate(osThread(ledAlive), NULL);

  /* definition and creation of linuxComms */
  osThreadStaticDef(linuxComms, runLinuxComms, osPriorityNormal, 0, 128, linuxCommsBuffer, &linuxCommsControlBlock);
  linuxCommsHandle = osThreadCreate(osThread(linuxComms), NULL);

  /* USER CODE BEGIN RTOS_THREADS */
	/* add threads, ... */
	log_info("main_running");
	system_run();
  /* USER CODE END RTOS_THREADS */

  /* Start scheduler */
  osKernelStart();

  /* We should never get here as control is now taken by the scheduler */
  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
	while (1) {
    /* USER CODE END WHILE */

